Catalogs/Вакансии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Вакансии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Document.ЗаявкаНаПодборПерсонала</xr:Item>
				<xr:Item>Catalog.ПрофилиДолжностей</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрофильДолжности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофилиДолжностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредполагаемыйДоход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируемаяДатаЗакрытия</Name>
					<Comment>АПК:58 Имя не меняется для сохранения совместимости, синоним меняется на более лаконичный</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСостояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияВакансии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДатаСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаПодборПерсонала</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Comment>АПК:58 Имя не меняется для сохранения совместимости, синоним меняется для единообразия с заявкой в форме «Согласование вакансий»</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоответствуетПрофилюДолжности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Требования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязанности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Условия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сложность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Приоритет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОткрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОткрытияВакансий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособНабора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособНабораПерсоналаНаВакансию</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеНабора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НазначениеНабораПерсоналаНаВакансию</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоваяПозиция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспытательныйСрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ХарактеристикиПерсонала</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗначенияХарактеристик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяПроверка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяОбучение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесЗначения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьЗначение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ХарактеристикиПерсонала</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДействияСотрудников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДействиеСотрудника</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДействияСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭтапыРаботыСКандидатами</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭтапРаботы</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЭтапРаботыСКандидатами</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонАнкеты</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ИнструментОценкиХарактеристикПерсонала</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособОценкиХарактеристик</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыОценкиХарактеристик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/СостоянияВакансий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СостоянияВакансий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияВакансии</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Вакансия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вакансии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СостоянияСогласования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассматривается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Готовится</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапланированоОбучение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособНабораПерсоналаНаВакансию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособНабораПерсоналаНаВакансию</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МассовыйНабор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕдиничныйНабор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/НазначениеНабораПерсоналаНаВакансию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>НазначениеНабораПерсоналаНаВакансию</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПозицияШтатногоРасписания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДолжностьПодразделение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияВакансии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СостоянияВакансии</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Открыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приостановлена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Вакансии/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Или ЭтоНовый() Тогда
		ЗаполнитьНовыйОбъект();
	КонецЕсли;
	
	ЗаполнитьПоПрофилюДолжности(ДанныеЗаполнения);
	ЗаполнитьПоЗаявкеНаПодборПерсонала(ДанныеЗаполнения);
	ЗаполнитьПоСотруднику(ДанныеЗаполнения);
	ЗаполнитьПоДаннымЗаполнения(ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверитьЗаполнениеПозиции(Отказ, ПроверяемыеРеквизиты);
	ПроверитьЗаполнениеДолжности(Отказ, ПроверяемыеРеквизиты);
	ПроверитьЗаполнениеПодразделения(Отказ, ПроверяемыеРеквизиты);
	
	// По одной заявке допустимо создавать только одну вакансию.
	Если ЕстьДругиеВакансииПоЗаявке(Основание, Ссылка) Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'По заявке %1 уже существуют ранее зарегистрированные вакансии.'"), Основание);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Основание = Неопределено;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		ЗаполнитьСостоянияВакансий();
	КонецЕсли;
	
	ПроверитьНаличиеВакансийМассовогоНабора(Отказ);
	ЗаполнитьПризнакиИзмененности();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("Изменены") И ДополнительныеСвойства.Изменены.Найти("ЭтапыРаботыСКандидатамиИзменены") <> Неопределено Тогда
		ЭлектронноеИнтервью.ОтменитьАнкетыУдаленныхЭтапов(Ссылка);
	КонецЕсли;
	
	ЗаписатьСостоянияВакансии();
	
	ОбновитьКандидатовПоВакансии();
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоПрофилюДолжности(Профиль, ЗаполнятьПозициюШтатногоРасписания = Истина,
	ДанныеПрофиля = Неопределено, СоответствуетПрофилюДолжностиЧисло = 1) Экспорт
	
	Если ТипЗнч(Профиль) <> Тип("СправочникСсылка.ПрофилиДолжностей") Тогда
		Возврат;
	КонецЕсли;
	
	ПрофильДолжности = Профиль;
	
	Если ДанныеПрофиля = Неопределено Тогда
		ПараметрыПолучения = Справочники.ПрофилиДолжностей.ПараметрыПолученияДанныхПрофиляДолжности();
		ПараметрыПолучения.ЭтапыРаботыСКандидатами = Истина;
		ДанныеПрофиля = Справочники.ПрофилиДолжностей.ДанныеПрофиляДолжности(Профиль, ПараметрыПолучения);
	КонецЕсли;
	
	Если ЗаполнятьПозициюШтатногоРасписания Тогда
		ПодобратьПозициюПодразделениеДолжностьПоПрофилюДолжности(ДанныеПрофиля);
	КонецЕсли;
	
	Если ДанныеПрофиля.Свойство("ХарактеристикиПерсонала") Тогда
		ХарактеристикиПерсонала.Очистить();
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеПрофиля.ХарактеристикиПерсонала, ХарактеристикиПерсонала);
	КонецЕсли;
	Если ДанныеПрофиля.Свойство("ДействияСотрудников") Тогда
		ДействияСотрудников.Очистить();
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеПрофиля.ДействияСотрудников, ДействияСотрудников);
	КонецЕсли;
	
	Требования = ДанныеПрофиля.Требования;
	Обязанности = ДанныеПрофиля.Обязанности;
	Условия = ДанныеПрофиля.Условия;
	
	ИспытательныйСрок = ДанныеПрофиля.ИспытательныйСрок;
	
	ЭтапыРаботыСКандидатами.Очистить();
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеПрофиля.ЭтапыРаботыСКандидатами, ЭтапыРаботыСКандидатами);
	
	Если СоответствуетПрофилюДолжностиЧисло = 1 Тогда
		СоответствуетПрофилюДолжности = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоПозицииШтатногоРасписания(ПозицияШтатногоРасписания, ЗаполнятьПрофильДолжности = Истина, ЗаполнятьПоПрофилюДолжности = Истина) Экспорт
	
	Позиция = ПозицияШтатногоРасписания;
	
	ДанныеПозиции = Справочники.ШтатноеРасписание.ДанныеПозицииШтатногоРасписания(ПозицияШтатногоРасписания);
	
	Подразделение = ДанныеПозиции.МестоВСтруктуреПредприятия;
	ПредполагаемыйДоход = ДанныеПозиции.ФОТ;
	Должность = ДанныеПозиции.Должность;
	
	ЗаполнитьРабочееМестоПоПозиции(ДанныеПозиции);
	
	ЗаполнитьЗаявителяРуководителемПодразделения();
	
	Если Не ЗаполнятьПрофильДолжности Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДанныеПозиции.Свойство("ПрофильДолжности") Или Не ЗначениеЗаполнено(ДанныеПозиции.ПрофильДолжности) Тогда
		Возврат;
	КонецЕсли;
	
	ПрофильДолжности = ДанныеПозиции.ПрофильДолжности;
	
	Если ЗаполнятьПоПрофилюДолжности Тогда
		ЗаполнитьПоПрофилюДолжности(ПрофильДолжности, Ложь);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьЗаявителяРуководителемПодразделения() Экспорт
	
	Если Не ЗначениеЗаполнено(Подразделение) Тогда
		Возврат;
	КонецЕсли;
	
	Заявитель = Неопределено;
	
	ДанныеРуководителя = Неопределено;
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.РуководителиПодразделений") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("РуководителиПодразделений");
		ДанныеРуководителя = Модуль.ДанныеРуководителей(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Подразделение))[Подразделение];
	КонецЕсли;	
	
	Если ДанныеРуководителя = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Заявитель = ФизическиеЛицаЗарплатаКадры.ПользовательФизическогоЛица(ДанныеРуководителя.ФизическоеЛицо);
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаявкеНаПодборПерсонала(ДокументСсылка) Экспорт
	
	Если ТипЗнч(ДокументСсылка) <> Тип("ДокументСсылка.ЗаявкаНаПодборПерсонала") Тогда
		Возврат;
	КонецЕсли;
	
	// Проверим, нет ли на основании указанной заявки уже зарегистрированных вакансий
	Если ЕстьДругиеВакансииПоЗаявке(ДокументСсылка, Ссылка) Тогда
		ВызватьИсключение НСтр("ru = 'По этой заявке на подбор персонала вакансия уже зарегистрирована.'");
	КонецЕсли;
	
	// Получаем данные заявки для заполнения
	ДанныеЗаявки = Документы.ЗаявкаНаПодборПерсонала.ДанныеЗаявкиНаПодборПерсонала(ДокументСсылка);
	
	// Проверим, согласована ли заявка 
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСогласованиеВакансий") Тогда
		ДанныеСогласования = СогласованиеВакансий.ДанныеСогласования(ДокументСсылка);
		Если ДанныеСогласования.СостояниеСогласования <> Перечисления.СостоянияСогласования.Согласовано Тогда
			ВызватьИсключение НСтр("ru = 'Заявка не согласована.'");
		КонецЕсли;
	КонецЕсли;
	
	// Проверим, нет ли зарегистрированных вакансий с параметрами заявки
	Если ДанныеЗаявки.СпособНабора = Перечисления.СпособНабораПерсоналаНаВакансию.МассовыйНабор Тогда
		Если Справочники.Вакансии.ЕстьДругиеВакансииПоКомбинацииДолжностьПодразделение(ДанныеЗаявки.Должность, ДанныеЗаявки.Подразделение, ДокументСсылка, Ссылка) Тогда
			ВызватьИсключение НСтр("ru = 'Существует вакансия с аналогичными должностью и подразделением.'");
		КонецЕсли;
	КонецЕсли;
	
	// Заявка согласована, заполняем вакансию
	Если ЗначениеЗаполнено(ДанныеЗаявки.ПрофильДолжности) Тогда
		ЗаполнитьПоПрофилюДолжности(ДанныеЗаявки.ПрофильДолжности);
	КонецЕсли;
	
	Основание = ДокументСсылка;
	Позиция = ДанныеЗаявки.Позиция;
	Подразделение = ДанныеЗаявки.Подразделение;
	Должность = ДанныеЗаявки.Должность;
	Условия = ДанныеЗаявки.Условия;
	ПредполагаемыйДоход = ДанныеЗаявки.ПредполагаемыйДоход;
	ПланируемаяДатаЗакрытия = ДанныеЗаявки.ПланируемаяДатаЗакрытия;
	Приоритет = ДанныеЗаявки.Приоритет;
	ПричинаОткрытия = ДанныеЗаявки.ПричинаОткрытия;
	Заявитель = ДанныеЗаявки.Ответственный;
	Примечание = ДанныеЗаявки.Комментарий;
	СпособНабора = ДанныеЗаявки.СпособНабора;
	НазначениеНабора = ДанныеЗаявки.НазначениеНабора;
	НоваяПозиция = ДанныеЗаявки.НоваяПозиция;
	Требования = ДанныеЗаявки.Требования;
	Обязанности = ДанныеЗаявки.Обязанности;
	РабочееМесто = ДанныеЗаявки.РабочееМесто;
	
	Если ДанныеЗаявки.Свойство("ХарактеристикиПерсонала") Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеЗаявки.ХарактеристикиПерсонала, ХарактеристикиПерсонала);
	КонецЕсли;
	Если ДанныеЗаявки.Свойство("ДействияСотрудников") Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеЗаявки.ДействияСотрудников, ДействияСотрудников);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоСотруднику(ДанныеЗаполнения)
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("СправочникСсылка.Сотрудники") Тогда
		Возврат;
	КонецЕсли;

	НоваяПозиция = Ложь;
	СпособНабора = Перечисления.СпособНабораПерсоналаНаВакансию.ЕдиничныйНабор;

	КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудников(Истина, ДанныеЗаполнения, "ДолжностьПоШтатномуРасписанию");
	Если КадровыеДанные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ПозицияШтатногоРасписания = КадровыеДанные[0].ДолжностьПоШтатномуРасписанию;;
	ЗаполнитьПоПозицииШтатногоРасписания(ПозицияШтатногоРасписания);

КонецПроцедуры

Процедура ЗаполнитьПоДаннымЗаполнения(ДанныеЗаполнения)
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	
	Если СпособНабора = Перечисления.СпособНабораПерсоналаНаВакансию.МассовыйНабор И Не ЗначениеЗаполнено(Позиция) Тогда
		НазначениеНабора = Перечисления.НазначениеНабораПерсоналаНаВакансию.ДолжностьПодразделение;
	КонецЕсли;
	
	Если НоваяПозиция Тогда
		НазначениеНабора = Перечисления.НазначениеНабораПерсоналаНаВакансию.ДолжностьПодразделение;
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("Наименование") Тогда
		НаименованиеВручную = Истина;
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("ПрофильДолжности") Тогда
		Если ЗначениеЗаполнено(ДанныеЗаполнения.ПрофильДолжности) Тогда
			ЗаполнитьПоПрофилюДолжности(ДанныеЗаполнения["ПрофильДолжности"], Не ДанныеЗаполнения.Свойство("Позиция"));
		КонецЕсли;
	КонецЕсли;

	Если ДанныеЗаполнения.Свойство("Позиция") Тогда
		Если ЗначениеЗаполнено(ДанныеЗаполнения.Позиция) Тогда
			ЗаполнитьПоПозицииШтатногоРасписания(ДанныеЗаполнения["Позиция"], Не ДанныеЗаполнения.Свойство("ПрофильДолжности"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ЕстьДругиеВакансииПоЗаявке(Заявка, Вакансия)
	
	Если Не ЗначениеЗаполнено(Заявка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК Поле1
		|ИЗ
		|	Справочник.Вакансии КАК Вакансии
		|ГДЕ
		|	Вакансии.Ссылка <> &Вакансия
		|	И Вакансии.Основание = &Основание";
		
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Вакансия", Вакансия);
	Запрос.УстановитьПараметр("Основание", Заявка);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

Процедура ОбновитьКандидатовПоВакансии()
	
	Если Не ДополнительныеСвойства.Свойство("Изменены") Тогда
		Возврат;
	КонецЕсли;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Справочник.Кандидаты");
	ЭлементБлокировки.УстановитьЗначение("Вакансия", Ссылка);
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		КандидатыМассив = Справочники.Кандидаты.КандидатыПоОтбору(Новый Структура("Вакансия", Ссылка));
		Если ОбновлятьКандидатов(ДополнительныеСвойства.Изменены) Тогда
			Для Каждого Кандидат Из КандидатыМассив Цикл
				КандидатОбъект = Кандидат.ПолучитьОбъект();
				Попытка
					КандидатОбъект.Заблокировать();
					КандидатОбъект.Заполнить(Ссылка);
					КандидатОбъект.Записать();
				Исключение
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Требуется обновить кандидата %1. 
	                          |В данный момент изменение невозможно, так как кандидат редактируется другим пользователем или в другой форме программы.'"),
						КандидатОбъект.Наименование);
					ВызватьИсключение ТекстСообщения;
				КонецПопытки;
			КонецЦикла;
			Если ДополнительныеСвойства.Изменены.Найти("ЭтапыРаботыСКандидатами") <> Неопределено Тогда
				ПодборПерсонала.ОбновитьТекущийЭтапРаботыКандидатов(КандидатыМассив);
			КонецЕсли;
		КонецЕсли;
		Если ДополнительныеСвойства.Изменены.Найти("ХарактеристикиПерсонала") <> Неопределено Тогда
			ЭлектронноеИнтервью.РассчитатьОценкиКандидатов(Ссылка, КандидатыМассив);
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Функция ОбновлятьКандидатов(Изменены)
	Возврат Изменены.Найти("Позиция") <> Неопределено 
		Или Изменены.Найти("Подразделение") <> Неопределено 
		Или Изменены.Найти("ЭтапыРаботыСКандидатами") <> Неопределено;
КонецФункции

Процедура ЗаполнитьПризнакиИзмененности()
	
	Если Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ПрежнийОбъект = Ссылка.ПолучитьОбъект();
	
	ДополнительныеСвойства.Вставить("Изменены", Новый Массив);
	
	Если ПрежнийОбъект.Позиция <> Позиция Тогда
		ДополнительныеСвойства.Изменены.Добавить("Позиция");
	КонецЕсли;

	Если ПрежнийОбъект.Подразделение <> Подразделение Тогда
		ДополнительныеСвойства.Изменены.Добавить("Подразделение");
	КонецЕсли;
	
	ИменаКолонок = "ЭтапРаботы,ШаблонАнкеты,СпособОценкиХарактеристик,Комментарий";
	Если Не ОбщегоНазначения.КоллекцииИдентичны(ЭтапыРаботыСКандидатами, ПрежнийОбъект.ЭтапыРаботыСКандидатами, ИменаКолонок, , Истина) Тогда
		ДополнительныеСвойства.Изменены.Добавить("ЭтапыРаботыСКандидатами");
	КонецЕсли;
	
	ИменаКолонок = "Характеристика,Значение,Вес,ТребуетсяПроверка,ТребуетсяОбучение,ВесЗначения";
	Если Не ОбщегоНазначения.КоллекцииИдентичны(ХарактеристикиПерсонала, ПрежнийОбъект.ХарактеристикиПерсонала, ИменаКолонок) Тогда
		ДополнительныеСвойства.Изменены.Добавить("ХарактеристикиПерсонала");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеПозиции(Отказ, ПроверяемыеРеквизиты)
	
	Если НазначениеНабора = Перечисления.НазначениеНабораПерсоналаНаВакансию.ДолжностьПодразделение Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "Позиция");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеПодразделения(Отказ, ПроверяемыеРеквизиты)
	
	Если СпособНабора = Перечисления.СпособНабораПерсоналаНаВакансию.МассовыйНабор Или НоваяПозиция Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "Подразделение");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеДолжности(Отказ, ПроверяемыеРеквизиты)
	
	Если НоваяПозиция Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "Должность");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодобратьПозициюПодразделениеДолжностьПоПрофилюДолжности(ДанныеПрофиля)
	
	// Попробуем подобрать позицию штатного расписания, если штатное расписание используется.
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьШтатноеРасписание") Тогда
		// Штатное расписание не используется, заполняем независимо от позиции подразделение и должность.
		Подразделение = ДанныеПрофиля.Подразделение;
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Позиция) Тогда
		Возврат;
	КонецЕсли;

	ПараметрыПостроения = УправлениеШтатнымРасписанием.ПараметрыПостроенияВТШтатноеРасписание();
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыПостроения.Отборы, 
		"Должность", "=", ДанныеПрофиля.Должность);
	
	Запрос = УправлениеШтатнымРасписанием.ЗапросВТШтатноеРасписание(Истина, 
		ПараметрыПостроения, "МестоВСтруктуреПредприятия, Утверждена, ДатаУтверждения, ДатаЗакрытия", "");
	
	ТаблицаПозицийШР = Запрос.Выполнить().Выгрузить();
	ТаблицаПозицийШР.Сортировать("ДатаУтверждения");

	ПозицияПоТолькоДолжности = Неопределено;
	ПозицияПоДолжностиПодразделению = Неопределено;
	Для Каждого СтрокаТаблицы Из ТаблицаПозицийШР Цикл
		Если ЭтоДействующаяПозиция(СтрокаТаблицы) Тогда
			ПозицияПоТолькоДолжности = СтрокаТаблицы.ПозицияШтатногоРасписания;
			Если СтрокаТаблицы.МестоВСтруктуреПредприятия = ДанныеПрофиля.Подразделение Тогда
				ПозицияПоДолжностиПодразделению = СтрокаТаблицы.ПозицияШтатногоРасписания;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Если ЗначениеЗаполнено(ПозицияПоДолжностиПодразделению) Или ЗначениеЗаполнено(ПозицияПоТолькоДолжности) Тогда
		ЗаполнитьПоПозицииШтатногоРасписания(
			?(ЗначениеЗаполнено(ПозицияПоДолжностиПодразделению), ПозицияПоДолжностиПодразделению, ПозицияПоТолькоДолжности), 
			Ложь);
	КонецЕсли;

КонецПроцедуры

// Выполняет условие по проверке на то, что это действующая позиция.
// 
// Параметры:
//  ДанныеПозиции - СтрокаТаблицыЗначений:
//  * Утверждена - Булево - 
//  * ДатаУтверждения - Дата - 
//  * ДатаЗакрытия - Дата
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоДействующаяПозиция(ДанныеПозиции)
	
	Сегодня = НачалоДня(ТекущаяДатаСеанса());
	
	Возврат ?(ДанныеПозиции.Утверждена, 
		ДанныеПозиции.ДатаУтверждения <= Сегодня 
			И (Сегодня < ДанныеПозиции.ДатаЗакрытия Или Не ЗначениеЗаполнено(ДанныеПозиции.ДатаЗакрытия)), 
		ДанныеПозиции.ДатаЗакрытия > Сегодня); // проверка на закрытие будущей датой
	
КонецФункции
	
Процедура ПроверитьНаличиеВакансийМассовогоНабора(Отказ)
	
	ОписаниеСостояния = Справочники.Вакансии.СостояниеВакансии(Ссылка);
	Если ОписаниеСостояния = Неопределено 
		Или Перечисления.СостоянияВакансии.Действующие().Найти(ОписаниеСостояния.Состояние) = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если СпособНабора = Перечисления.СпособНабораПерсоналаНаВакансию.МассовыйНабор Тогда
		Если Справочники.Вакансии.ЕстьДругиеВакансииПоКомбинацииДолжностьПодразделение(Должность, Подразделение, , Ссылка) Тогда 
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'С такими должностью и подразделением уже есть открытая вакансия.'"), , , , Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНовыйОбъект() Экспорт
	
	Если Не Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		ЗначенияДляЗаполнения = Новый Структура;
		ЗначенияДляЗаполнения.Вставить("Ответственный", "Ответственный");
		ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтотОбъект, ЗначенияДляЗаполнения);
	КонецЕсли;
	
	ЗаполнитьСостоянияВакансий();

	Если ЗначениеЗаполнено(ДатаОткрытия) И Не ЗначениеЗаполнено(ПланируемаяДатаЗакрытия) Тогда
		ПланируемаяДатаЗакрытия = ПодборПерсонала.ПланируемаяДатаЗакрытияПоУмолчанию(ДатаОткрытия);
	КонецЕсли;
	
	ПодборПерсонала.ДобавитьДействующиеПредопределенныеЭтапы(ЭтапыРаботыСКандидатами);	
	
КонецПроцедуры

Процедура ЗаполнитьСостоянияВакансий()
	
	Если ДополнительныеСвойства.Свойство("СостоянияВакансийНаборЗаписей") Тогда
		Возврат;
	КонецЕсли;
	
	СостоянияВакансий = РегистрыСведений.СостоянияВакансий.СоздатьНаборЗаписей();
	
	НоваяЗапись = СостоянияВакансий.Добавить();
	НоваяЗапись.Вакансия = Ссылка;
	НоваяЗапись.Период = ТекущаяДатаСеанса();
	НоваяЗапись.Состояние = Перечисления.СостоянияВакансии.Открыта;
	
	ДатаОткрытия = НоваяЗапись.Период;
	
	ДополнительныеСвойства.Вставить("СостоянияВакансийНаборЗаписей", СостоянияВакансий);
	
КонецПроцедуры

Процедура ЗаписатьСостоянияВакансии()
	
	Если Не ДополнительныеСвойства.Свойство("СостоянияВакансийНаборЗаписей") Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = ДополнительныеСвойства.СостоянияВакансийНаборЗаписей; // РегистрСведенийНаборЗаписей.СостоянияВакансий
	НаборЗаписей.Отбор.Вакансия.Установить(Ссылка);
	Для Каждого СтрокаНабора Из НаборЗаписей Цикл
		СтрокаНабора.Вакансия = Ссылка;
	КонецЦикла;
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ЗаполнитьРабочееМестоПоПозиции(ДанныеПозиции)
	
	СписокРабочихМест = Новый СписокЗначений;
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.РабочиеМестаОхраныТруда") Тогда
		МодульРабочиеМестаОхраныТруда = ОбщегоНазначения.ОбщийМодуль("РабочиеМестаОхраныТруда");
		СписокРабочихМест = МодульРабочиеМестаОхраныТруда.РабочиеМестаПоПодразделениюИДолжности(
		ДанныеПозиции.Подразделение,
		ДанныеПозиции.Должность,
		ДанныеПозиции.Организация);
	КонецЕсли;
	
	Если СписокРабочихМест.Количество() = 1 Тогда
		РабочееМесто = СписокРабочихМест[0].Значение;
	Иначе
		РабочееМесто = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
